---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingStructuralUsage
source: html/3a1d96af-0993-c9c4-039b-4a39df72dba2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingStructuralUsage Property

"Structural Usage"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousFootingStructuralUsage { get; }
```